betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_bus.h
/**
  *
  * @file    apm32f4xx_ddl_bus.h
  * @brief   Header file of BUS DDL module.

  @verbatim
                      ##### RCM Limitations #####
  ==============================================================================
    [..]
      A delay between an RCM peripheral clock enable and the effective peripheral
      enabling should be taken into account in order to manage the peripheral read/write
      from/to registers.
      (+) This delay depends on the peripheral mapping.
        (++) AHB & APB peripherals, 1 dummy read is necessary

    [..]
      Workarounds:
      (#) For AHB & APB peripherals, a dummy read to the peripheral register has been
          inserted in each DDL_{BUS}_GRP{x}_EnableClock() function.

  @endverbatim
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification, 
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef APM32F4xx_DDL_BUS_H
#define APM32F4xx_DDL_BUS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx.h"

/** @addtogroup APM32F4xx_DDL_Driver
  * @{
  */

#if defined(RCM)

/** @defgroup BUS_DDL BUS
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup BUS_DDL_Exported_Constants BUS Exported Constants
  * @{
  */

/** @defgroup BUS_DDL_EC_AHB1_GRP1_PERIPH  AHB1 GRP1 PERIPH
  * @{
  */
#define DDL_AHB1_GRP1_PERIPH_ALL             0xFFFFFFFFU
#if defined(RCM_AHB1CLKEN_PAEN)
#define DDL_AHB1_GRP1_PERIPH_GPIOA           RCM_AHB1CLKEN_PAEN
#endif /* RCM_AHB1CLKEN_PAEN */
#if defined(RCM_AHB1CLKEN_PBEN)
#define DDL_AHB1_GRP1_PERIPH_GPIOB           RCM_AHB1CLKEN_PBEN
#endif /* RCM_AHB1CLKEN_PBEN */
#if defined(RCM_AHB1CLKEN_PCEN)
#define DDL_AHB1_GRP1_PERIPH_GPIOC           RCM_AHB1CLKEN_PCEN
#endif /* RCM_AHB1CLKEN_PCEN */
#if defined(RCM_AHB1CLKEN_PDEN)
#define DDL_AHB1_GRP1_PERIPH_GPIOD           RCM_AHB1CLKEN_PDEN
#endif /* RCM_AHB1CLKEN_PDEN */
#if defined(RCM_AHB1CLKEN_PEEN)
#define DDL_AHB1_GRP1_PERIPH_GPIOE           RCM_AHB1CLKEN_PEEN
#endif /* RCM_AHB1CLKEN_PEEN */
#if defined(RCM_AHB1CLKEN_PFEN)
#define DDL_AHB1_GRP1_PERIPH_GPIOF           RCM_AHB1CLKEN_PFEN
#endif /* RCM_AHB1CLKEN_PFEN */
#if defined(RCM_AHB1CLKEN_PGEN)
#define DDL_AHB1_GRP1_PERIPH_GPIOG           RCM_AHB1CLKEN_PGEN
#endif /* RCM_AHB1CLKEN_PGEN */
#if defined(RCM_AHB1CLKEN_PHEN)
#define DDL_AHB1_GRP1_PERIPH_GPIOH           RCM_AHB1CLKEN_PHEN
#endif /* RCM_AHB1CLKEN_PHEN */
#if defined(RCM_AHB1CLKEN_PIEN)
#define DDL_AHB1_GRP1_PERIPH_GPIOI           RCM_AHB1CLKEN_PIEN
#endif /* RCM_AHB1CLKEN_PIEN */
#define DDL_AHB1_GRP1_PERIPH_CRC             RCM_AHB1CLKEN_CRCEN
#if defined(RCM_AHB1CLKEN_BKPSRAMEN)
#define DDL_AHB1_GRP1_PERIPH_BKPSRAM         RCM_AHB1CLKEN_BKPSRAMEN
#endif /* RCM_AHB1CLKEN_BKPSRAMEN */
#if defined(RCM_AHB1CLKEN_DRAMEN)
#define DDL_AHB1_GRP1_PERIPH_CCMDATARAM      RCM_AHB1CLKEN_DRAMEN
#endif /* RCM_AHB1CLKEN_DRAMEN */
#define DDL_AHB1_GRP1_PERIPH_DMA1            RCM_AHB1CLKEN_DMA1EN
#define DDL_AHB1_GRP1_PERIPH_DMA2            RCM_AHB1CLKEN_DMA2EN
#if defined(RCM_AHB1CLKEN_SRAMEN)
#define DDL_AHB1_GRP1_PERIPH_SRAM            RCM_AHB1CLKEN_SRAMEN
#endif /* RCM_AHB1CLKEN_SRAMEN */
#if defined(RCM_AHB1CLKEN_FMCEN)
#define DDL_AHB1_GRP1_PERIPH_FLASH           RCM_AHB1CLKEN_FMCEN
#endif /* RCM_AHB1CLKEN_FMCEN */
#if defined(ETH)
#define DDL_AHB1_GRP1_PERIPH_ETHMAC          RCM_AHB1CLKEN_ETHEN
#define DDL_AHB1_GRP1_PERIPH_ETHMACTX        RCM_AHB1CLKEN_ETHTXEN
#define DDL_AHB1_GRP1_PERIPH_ETHMACRX        RCM_AHB1CLKEN_ETHRXEN
#define DDL_AHB1_GRP1_PERIPH_ETHMACPTP       RCM_AHB1CLKEN_ETHPTPEN
#endif /* ETH */
#if defined(RCM_AHB1CLKEN_OTGFSEN)
#define DDL_AHB1_GRP1_PERIPH_OTGFS           RCM_AHB1CLKEN_OTGFSEN
#endif /* RCM_AHB1CLKEN_OTGFSEN */
#if defined(USB_OTG_HS)
#define DDL_AHB1_GRP1_PERIPH_OTGHS           RCM_AHB1CLKEN_OTGHS1EN
#define DDL_AHB1_GRP1_PERIPH_OTGHSULPI       RCM_AHB1CLKEN_OTGHSULPIEN
#endif /* USB_OTG_HS */
#if defined(USB_OTG_FS2)
#define DDL_AHB1_GRP1_PERIPH_OTGFS2          RCM_AHB1CLKEN_OTGFS2EN
#endif /* USB_OTG_FS2 */
#if defined(RCM_LPAHB1CLKEN_FMCEN)
#define DDL_AHB1_GRP1_PERIPH_FLITF           RCM_LPAHB1CLKEN_FMCEN
#endif /* RCM_LPAHB1CLKEN_FMCEN */
#if defined(RCM_LPAHB1CLKEN_SRAM1EN)
#define DDL_AHB1_GRP1_PERIPH_SRAM1           RCM_LPAHB1CLKEN_SRAM1EN
#endif /* RCM_LPAHB1CLKEN_SRAM1EN */
#if defined(RCM_LPAHB1CLKEN_SRAM2EN)
#define DDL_AHB1_GRP1_PERIPH_SRAM2           RCM_LPAHB1CLKEN_SRAM2EN
#endif /* RCM_LPAHB1CLKEN_SRAM2EN */
#if defined(RCM_LPAHB1CLKEN_SRAM3EN)
#define DDL_AHB1_GRP1_PERIPH_SRAM3           RCM_LPAHB1CLKEN_SRAM3EN
#endif /* RCM_LPAHB1CLKEN_SRAM3EN */
/**
  * @}
  */

#if defined(RCM_AHB2_SUPPORT)
/** @defgroup BUS_DDL_EC_AHB2_GRP1_PERIPH  AHB2 GRP1 PERIPH
  * @{
  */
#define DDL_AHB2_GRP1_PERIPH_ALL            0xFFFFFFFFU
#if defined(DCI)
#define DDL_AHB2_GRP1_PERIPH_DCI            RCM_AHB2CLKEN_DCIEN
#endif /* DCI */

#define DDL_AHB2_GRP1_PERIPH_FPU            RCM_AHB2CLKEN_FPUEN
#if defined(BN)
#define DDL_AHB2_GRP1_PERIPH_BN             RCM_AHB2CLKEN_BNEN
#endif /* BN */

