betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_bus.h
#if defined(SM3) || defined(SM4)
#define DDL_AHB2_GRP1_PERIPH_SM             RCM_AHB2CLKEN_SMEN
#endif /* SM3 || SM4 */

#if defined(CRYP)
#define DDL_AHB2_GRP1_PERIPH_CRYP           RCM_AHB2CLKEN_CRYPEN
#endif /* CRYP */
#if defined(HASH)
#define DDL_AHB2_GRP1_PERIPH_HASH           RCM_AHB2CLKEN_HASHEN
#endif /* HASH */
#if defined(RCM_AHB2CLKEN_RNGEN)
#define DDL_AHB2_GRP1_PERIPH_RNG            RCM_AHB2CLKEN_RNGEN
#endif /* RCM_AHB2CLKEN_RNGEN */
#if defined(RCM_AHB2CLKEN_OTGFSEN)
#define DDL_AHB2_GRP1_PERIPH_OTGFS          RCM_AHB2CLKEN_OTGFSEN
#endif /* RCM_AHB2CLKEN_OTGFSEN */
#if defined(RCM_AHB2CLKEN_QSPIEN)
#define DDL_AHB2_GRP1_PERIPH_QSPI           RCM_AHB2CLKEN_QSPIEN
#endif /* RCM_AHB2CLKEN_QSPIEN */
#if defined(RCM_AHB2CLKEN_SMCEN)
#define DDL_AHB2_GRP1_PERIPH_SMC            RCM_AHB2CLKEN_SMCEN
#endif /* RCM_AHB2CLKEN_SMCEN */
/**
  * @}
  */
#endif /* RCM_AHB2_SUPPORT */

#if defined(RCM_AHB3_SUPPORT)
/** @defgroup BUS_DDL_EC_AHB3_GRP1_PERIPH  AHB3 GRP1 PERIPH
  * @{
  */
#define DDL_AHB3_GRP1_PERIPH_ALL            0xFFFFFFFFU
#if defined(RCM_AHB3CLKEN_EMMCEN)
#define DDL_AHB3_GRP1_PERIPH_EMMC           RCM_AHB3CLKEN_EMMCEN
#endif /* RCM_AHB3CLKEN_EMMCEN */
#if defined(RCM_AHB3CLKEN_QSPIEN)
#define DDL_AHB3_GRP1_PERIPH_QSPI           RCM_AHB3CLKEN_QSPIEN
#endif /* RCM_AHB3CLKEN_QSPIEN */
/**
  * @}
  */
#endif /* RCM_AHB3_SUPPORT */

/** @defgroup BUS_DDL_EC_APB1_GRP1_PERIPH  APB1 GRP1 PERIPH
  * @{
  */
#define DDL_APB1_GRP1_PERIPH_ALL            0xFFFFFFFFU
#if defined(TMR2)
#define DDL_APB1_GRP1_PERIPH_TMR2           RCM_APB1CLKEN_TMR2EN
#endif /* TMR2 */
#if defined(TMR3)
#define DDL_APB1_GRP1_PERIPH_TMR3           RCM_APB1CLKEN_TMR3EN
#endif /* TMR3 */
#if defined(TMR4)
#define DDL_APB1_GRP1_PERIPH_TMR4           RCM_APB1CLKEN_TMR4EN
#endif /* TMR4 */
#define DDL_APB1_GRP1_PERIPH_TMR5           RCM_APB1CLKEN_TMR5EN
#if defined(TMR6)
#define DDL_APB1_GRP1_PERIPH_TMR6           RCM_APB1CLKEN_TMR6EN
#endif /* TMR6 */
#if defined(TMR7)
#define DDL_APB1_GRP1_PERIPH_TMR7           RCM_APB1CLKEN_TMR7EN
#endif /* TMR7 */
#if defined(TMR12)
#define DDL_APB1_GRP1_PERIPH_TMR12          RCM_APB1CLKEN_TMR12EN
#endif /* TMR12 */
#if defined(TMR13)
#define DDL_APB1_GRP1_PERIPH_TMR13          RCM_APB1CLKEN_TMR13EN
#endif /* TMR13 */
#if defined(TMR14)
#define DDL_APB1_GRP1_PERIPH_TMR14          RCM_APB1CLKEN_TMR14EN
#endif /* TMR14 */
#define DDL_APB1_GRP1_PERIPH_WWDT           RCM_APB1CLKEN_WWDTEN
#if defined(SPI2)
#define DDL_APB1_GRP1_PERIPH_SPI2           RCM_APB1CLKEN_SPI2EN
#endif /* SPI2 */
#if defined(SPI3)
#define DDL_APB1_GRP1_PERIPH_SPI3           RCM_APB1CLKEN_SPI3EN
#endif /* SPI3 */
#define DDL_APB1_GRP1_PERIPH_USART2         RCM_APB1CLKEN_USART2EN
#if defined(USART3)
#define DDL_APB1_GRP1_PERIPH_USART3         RCM_APB1CLKEN_USART3EN
#endif /* USART3 */
#if defined(UART4)
#define DDL_APB1_GRP1_PERIPH_UART4          RCM_APB1CLKEN_UART4EN
#endif /* UART4 */
#if defined(UART5)
#define DDL_APB1_GRP1_PERIPH_UART5          RCM_APB1CLKEN_UART5EN
#endif /* UART5 */
#define DDL_APB1_GRP1_PERIPH_I2C1           RCM_APB1CLKEN_I2C1EN
#if defined(I2C2)
#define DDL_APB1_GRP1_PERIPH_I2C2           RCM_APB1CLKEN_I2C2EN
#endif /* I2C2 */
#if defined(I2C3)
#define DDL_APB1_GRP1_PERIPH_I2C3           RCM_APB1CLKEN_I2C3EN
#endif /* I2C3 */
#if defined(CAN1)
#define DDL_APB1_GRP1_PERIPH_CAN1           RCM_APB1CLKEN_CAN1EN
#endif /* CAN1 */
#if defined(CAN2)
#define DDL_APB1_GRP1_PERIPH_CAN2           RCM_APB1CLKEN_CAN2EN
#endif /* CAN2 */
#if defined(CAN3)
#define DDL_APB1_GRP1_PERIPH_CAN3           RCM_APB1CLKEN_CAN3EN
#endif /* CAN3 */
#if defined(RCM_APB1CLKEN_BAKPEN)
#define DDL_APB1_GRP1_PERIPH_BAKP           RCM_APB1CLKEN_BAKPEN
#endif /* RCM_APB1CLKEN_BAKPEN */
#define DDL_APB1_GRP1_PERIPH_PMU            RCM_APB1CLKEN_PMUEN
#if defined(DAC1)
#define DDL_APB1_GRP1_PERIPH_DAC1           RCM_APB1CLKEN_DACEN
#endif /* DAC1 */
#if defined(UART7)
#define DDL_APB1_GRP1_PERIPH_UART7          RCM_APB1CLKEN_UART7EN
#endif /* UART7 */
#if defined(UART8)
#define DDL_APB1_GRP1_PERIPH_UART8          RCM_APB1CLKEN_UART8EN
#endif /* UART8 */
/**
  * @}
  */

/** @defgroup BUS_DDL_EC_APB2_GRP1_PERIPH  APB2 GRP1 PERIPH
  * @{
  */
#define DDL_APB2_GRP1_PERIPH_ALL          0xFFFFFFFFU
#if defined(AFIO)
#define DDL_APB2_GRP1_PERIPH_AFIO         RCM_APB2CLKEN_AFIOEN
#endif /* AFIO */
#if defined(RCM_APB2CLKEN_PAEN)
#define DDL_APB2_GRP1_PERIPH_GPIOA        RCM_APB2CLKEN_PAEN
#endif /* RCM_APB2CLKEN_PAEN */
#if defined(RCM_APB2CLKEN_PBEN)
#define DDL_APB2_GRP1_PERIPH_GPIOB        RCM_APB2CLKEN_PBEN
#endif /* RCM_APB2CLKEN_PBEN */
#if defined(RCM_APB2CLKEN_PCEN)
#define DDL_APB2_GRP1_PERIPH_GPIOC        RCM_APB2CLKEN_PCEN
#endif /* RCM_APB2CLKEN_PCEN */
#if defined(RCM_APB2CLKEN_PDEN)
#define DDL_APB2_GRP1_PERIPH_GPIOD        RCM_APB2CLKEN_PDEN
#endif /* RCM_APB2CLKEN_PDEN */
#define DDL_APB2_GRP1_PERIPH_TMR1         RCM_APB2CLKEN_TMR1EN
#if defined(TMR8)
#define DDL_APB2_GRP1_PERIPH_TMR8         RCM_APB2CLKEN_TMR8EN
#endif /* TMR8 */
#define DDL_APB2_GRP1_PERIPH_USART1       RCM_APB2CLKEN_USART1EN
#if defined(USART6)
#define DDL_APB2_GRP1_PERIPH_USART6       RCM_APB2CLKEN_USART6EN
#endif /* USART6 */
#define DDL_APB2_GRP1_PERIPH_ADC1         RCM_APB2CLKEN_ADC1EN
#if defined(ADC2)
#define DDL_APB2_GRP1_PERIPH_ADC2         RCM_APB2CLKEN_ADC2EN
#endif /* ADC2 */
#if defined(ADC3)
#define DDL_APB2_GRP1_PERIPH_ADC3         RCM_APB2CLKEN_ADC3EN
#endif /* ADC3 */
#if defined(SDIO)
#define DDL_APB2_GRP1_PERIPH_SDIO         RCM_APB2CLKEN_SDIOEN
#endif /* SDIO */
#define DDL_APB2_GRP1_PERIPH_SPI1         RCM_APB2CLKEN_SPI1EN
#if defined(SPI4)
#define DDL_APB2_GRP1_PERIPH_SPI4         RCM_APB2CLKEN_SPI4EN
#endif /* SPI4 */
#if defined(SYSCFG)
#define DDL_APB2_GRP1_PERIPH_SYSCFG       RCM_APB2CLKEN_SYSCFGEN
#endif /* SYSCFG */
#if defined(TMR9)
#define DDL_APB2_GRP1_PERIPH_TMR9         RCM_APB2CLKEN_TMR9EN
#endif /* TMR9 */
#if defined(TMR10)
#define DDL_APB2_GRP1_PERIPH_TMR10        RCM_APB2CLKEN_TMR10EN
#endif /* TMR10 */
#if defined(TMR11)
#define DDL_APB2_GRP1_PERIPH_TMR11        RCM_APB2CLKEN_TMR11EN
#endif /* TMR11 */
#if defined(SPI5)
#define DDL_APB2_GRP1_PERIPH_SPI5         RCM_APB2CLKEN_SPI5EN
#endif /* SPI5 */
#if defined(COMP1) || defined(COMP2)
#define DDL_APB2_GRP1_PERIPH_COMP         RCM_APB2CLKEN_SYSCFGEN
#endif /* COMP1 || COMP2 */
#if defined(RCM_APB2RST_ADCRST)
#define DDL_APB2_GRP1_PERIPH_ADC          RCM_APB2RST_ADCRST
#endif /* RCM_APB2RST_ADCRST */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @defgroup BUS_DDL_Exported_Functions BUS Exported Functions
  * @{
  */

/** @defgroup BUS_DDL_EF_AHB1 AHB1
  * @{
  */

/**
  * @brief  Enable AHB1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOA
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOB
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOD (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOE (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOG (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOH (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOI (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOJ (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOK (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_BKPSRAM (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_CCMDATARAM (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMAC (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACTX (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACRX (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACPTP (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGHS (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGHSULPI (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGFS2 (*)
  * 
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_SRAM
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGFS
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_AHB1_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCM->AHB1CLKEN, Periphs);
  /* Delay after an RCM peripheral clock enabling */
  tmpreg = READ_BIT(RCM->AHB1CLKEN, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB1 peripheral clock is enabled or not
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOA
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOB
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOD (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOE (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOG (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOH (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOI (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOJ (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOK (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_BKPSRAM (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_CCMDATARAM (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMAC (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACTX (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACRX (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACPTP (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGHS (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGHSULPI (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGFS2 (*)
  * 
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_SRAM
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGFS
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
*/
__STATIC_INLINE uint32_t DDL_AHB1_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return (READ_BIT(RCM->AHB1CLKEN, Periphs) == Periphs);
}

/**
  * @brief  Disable AHB1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOA
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOB
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOD (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOE (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOG (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOH (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOI (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOJ (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOK (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_BKPSRAM (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_CCMDATARAM (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMAC (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACTX (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACRX (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACPTP (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGHS (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGHSULPI (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGFS2 (*)
  *
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_SRAM
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGFS
  * 
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_AHB1_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCM->AHB1CLKEN, Periphs);
}

/**
  * @brief  Force AHB1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOA
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOB
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOD (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOE (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOG (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOH (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOI (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOJ (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOK (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMAC (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGHS (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGFS2 (*)
  *
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGFS
  * 
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_AHB1_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCM->AHB1RST, Periphs);
}

/**
  * @brief  Release AHB1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOA
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOB
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOD (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOE (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOG (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOH (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOI (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOJ (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOK (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMAC (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGHS (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGFS2 (*)
  *
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGFS

  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_AHB1_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCM->AHB1RST, Periphs);
}

#if defined(RCM_LPAHB1_SUPPORT)
/**
  * @brief  Enable AHB1 peripheral clocks in low-power mode
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOA
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOB
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOD (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOE (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOG (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOH (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOI (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOJ (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOK (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_BKPSRAM (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_FLITF
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_SRAM1
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_SRAM2 (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_SRAM3 (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMAC (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACTX (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACRX (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACPTP (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGHS (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGHSULPI (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGFS2 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_AHB1_GRP1_EnableClockLowPower(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCM->LPAHB1CLKEN, Periphs);
  /* Delay after an RCM peripheral clock enabling */
  tmpreg = READ_BIT(RCM->LPAHB1CLKEN, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable AHB1 peripheral clocks in low-power mode
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOA
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOB
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOD (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOE (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOG (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOH (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOI (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOJ (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_GPIOK (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_BKPSRAM (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_FLITF
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_SRAM1
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_SRAM2 (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_SRAM3 (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMAC (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACTX (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACRX (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_ETHMACPTP (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGHS (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGHSULPI (*)
  *         @arg @ref DDL_AHB1_GRP1_PERIPH_OTGFS2 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_AHB1_GRP1_DisableClockLowPower(uint32_t Periphs)
{
  CLEAR_BIT(RCM->LPAHB1CLKEN, Periphs);
}

