betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_bus.h
#endif /* RCM_LPAHB1_SUPPORT */

/**
  * @}
  */

#if defined(RCM_AHB2_SUPPORT)
/** @defgroup BUS_DDL_EF_AHB2 AHB2
  * @{
  */

/**
  * @brief  Enable AHB2 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_DCI (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_FPU (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_CRYP (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_OTGFS (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_QSPI (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_SMC (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  * @note   The SMC peripheral is available only in APM32F411xx devices.
*/
__STATIC_INLINE void DDL_AHB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCM->AHB2CLKEN, Periphs);
  /* Delay after an RCM peripheral clock enabling */
  tmpreg = READ_BIT(RCM->AHB2CLKEN, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB2 peripheral clock is enabled or not
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_DCI (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_FPU (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_CRYP (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_OTGFS (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_QSPI (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_SMC (*)
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  * @note   The AHB2 SMC peripheral is available only in APM32F411xx devices.
*/
__STATIC_INLINE uint32_t DDL_AHB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return (READ_BIT(RCM->AHB2CLKEN, Periphs) == Periphs);
}

/**
  * @brief  Disable AHB2 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_DCI (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_FPU (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_CRYP (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_OTGFS (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_QSPI (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_SMC (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  * @note   The AHB2 SMC peripheral is available only in APM32F411xx devices.
*/
__STATIC_INLINE void DDL_AHB2_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCM->AHB2CLKEN, Periphs);
}

/**
  * @brief  Force AHB2 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_DCI (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_FPU (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_CRYP (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_OTGFS (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_QSPI (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_SMC (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  * @note   The AHB2 SMC peripheral is available only in APM32F411xx devices.
*/
__STATIC_INLINE void DDL_AHB2_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCM->AHB2RST, Periphs);
}

/**
  * @brief  Release AHB2 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_DCI (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_FPU (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_CRYP (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_OTGFS (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_QSPI (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_SMC (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  * @note   The AHB2 SMC peripheral is available only in APM32F411xx devices.
*/
__STATIC_INLINE void DDL_AHB2_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCM->AHB2RST, Periphs);
}

#if defined(RCM_LPAHB2_SUPPORT)

/**
  * @brief  Enable AHB2 peripheral clocks in low-power mode
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_DCI (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_FPU (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_CRYP (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_OTGFS (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_QSPI (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_SMC (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  * @note   The AHB2 SMC peripheral is available only in APM32F411xx devices.
*/
__STATIC_INLINE void DDL_AHB2_GRP1_EnableClockLowPower(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCM->LPAHB2CLKEN, Periphs);
  /* Delay after an RCM peripheral clock enabling */
  tmpreg = READ_BIT(RCM->LPAHB2CLKEN, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable AHB2 peripheral clocks in low-power mode
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_DCI (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_FPU (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_CRYP (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_OTGFS (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_QSPI (*)
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_SMC (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  * @note   The AHB2 SMC peripheral is available only in APM32F411xx devices.
*/
__STATIC_INLINE void DDL_AHB2_GRP1_DisableClockLowPower(uint32_t Periphs)
{
  CLEAR_BIT(RCM->LPAHB2CLKEN, Periphs);
}

