betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_bus.h
#endif /* RCM_LPAHB2_SUPPORT */

/**
  * @}
  */
#endif /* RCM_AHB2_SUPPORT */

#if defined(RCM_AHB3_SUPPORT)
/** @defgroup BUS_DDL_EF_AHB3 AHB3
  * @{
  */

/**
  * @brief  Enable AHB3 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_EMMC (*)
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_QSPI (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_AHB3_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCM->AHB3CLKEN, Periphs);
  /* Delay after an RCM peripheral clock enabling */
  tmpreg = READ_BIT(RCM->AHB3CLKEN, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB3 peripheral clock is enabled or not
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_EMMC (*)
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_QSPI (*)
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
*/
__STATIC_INLINE uint32_t DDL_AHB3_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return (READ_BIT(RCM->AHB3CLKEN, Periphs) == Periphs);
}

/**
  * @brief  Disable AHB3 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_EMMC (*)
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_QSPI (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_AHB3_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCM->AHB3CLKEN, Periphs);
}

/**
  * @brief  Force AHB3 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_ALL
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_EMMC (*)
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_QSPI (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_AHB3_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCM->AHB3RST, Periphs);
}

/**
  * @brief  Release AHB3 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_EMMC (*)
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_QSPI (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_AHB3_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCM->AHB3RST, Periphs);
}

#if defined(RCM_LPAHB3_SUPPORT)

/**
  * @brief  Enable AHB3 peripheral clocks in low-power mode
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_EMMC (*)
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_QSPI (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_AHB3_GRP1_EnableClockLowPower(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCM->LPAHB3CLKEN, Periphs);
  /* Delay after an RCM peripheral clock enabling */
  tmpreg = READ_BIT(RCM->LPAHB3CLKEN, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable AHB3 peripheral clocks in low-power mode
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_EMMC (*)
  *         @arg @ref DDL_AHB3_GRP1_PERIPH_QSPI (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_AHB3_GRP1_DisableClockLowPower(uint32_t Periphs)
{
  CLEAR_BIT(RCM->LPAHB3CLKEN, Periphs);
}

#endif /* RCM_LPAHB3_SUPPORT */

/**
  * @}
  */
#endif /* RCM_AHB3_SUPPORT */

/** @defgroup BUS_DDL_EF_APB1 APB1
  * @{
  */

/**
  * @brief  Enable APB1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR5
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR6 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR7 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR12 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR13 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR14 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_WWDT
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART5 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_PMU
  *         @arg @ref DDL_APB1_GRP1_PERIPH_DAC1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART7 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART8 (*)
  *
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR5
  *         @arg @ref DDL_APB1_GRP1_PERIPH_WWDT
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_BAKP
  *         @arg @ref DDL_APB1_GRP1_PERIPH_PMU
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_APB1_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCM->APB1CLKEN, Periphs);
  /* Delay after an RCM peripheral clock enabling */
  tmpreg = READ_BIT(RCM->APB1CLKEN, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clock is enabled or not
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR5
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR6 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR7 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR12 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR13 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR14 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_WWDT
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART5 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_PMU
  *         @arg @ref DDL_APB1_GRP1_PERIPH_DAC1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART7 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART8 (*)
  * 
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR5
  *         @arg @ref DDL_APB1_GRP1_PERIPH_WWDT
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_BAKP
  *         @arg @ref DDL_APB1_GRP1_PERIPH_PMU
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
*/
__STATIC_INLINE uint32_t DDL_APB1_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return (READ_BIT(RCM->APB1CLKEN, Periphs) == Periphs);
}

/**
  * @brief  Disable APB1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR5
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR6 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR7 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR12 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR13 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR14 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_WWDT
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART5 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_PMU
  *         @arg @ref DDL_APB1_GRP1_PERIPH_DAC1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART7 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART8 (*)
  * 
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR5
  *         @arg @ref DDL_APB1_GRP1_PERIPH_WWDT
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_BAKP
  *         @arg @ref DDL_APB1_GRP1_PERIPH_PMU
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_APB1_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCM->APB1CLKEN, Periphs);
}

/**
  * @brief  Force APB1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR5
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR6 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR7 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR12 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR13 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR14 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_WWDT
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART5 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_PMU
  *         @arg @ref DDL_APB1_GRP1_PERIPH_DAC1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART7 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART8 (*)
  * 
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR5
  *         @arg @ref DDL_APB1_GRP1_PERIPH_WWDT
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_BAKP
  *         @arg @ref DDL_APB1_GRP1_PERIPH_PMU
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_APB1_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCM->APB1RST, Periphs);
}

/**
  * @brief  Release APB1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR5
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR6 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR7 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR12 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR13 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR14 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_WWDT
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART5 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_PMU
  *         @arg @ref DDL_APB1_GRP1_PERIPH_DAC1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART7 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART8 (*)
  * 
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR5
  *         @arg @ref DDL_APB1_GRP1_PERIPH_WWDT
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_BAKP
  *         @arg @ref DDL_APB1_GRP1_PERIPH_PMU
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_APB1_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCM->APB1RST, Periphs);
}

