betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_bus.h
#if defined(RCM_LPAPB1_SUPPORT)

/**
  * @brief  Enable APB1 peripheral clocks in low-power mode
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR5
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR6 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR7 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR12 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR13 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR14 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_WWDT
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART5 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_PMU
  *         @arg @ref DDL_APB1_GRP1_PERIPH_DAC1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART7 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART8 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_APB1_GRP1_EnableClockLowPower(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCM->LPAPB1CLKEN, Periphs);
  /* Delay after an RCM peripheral clock enabling */
  tmpreg = READ_BIT(RCM->LPAPB1CLKEN, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable APB1 peripheral clocks in low-power mode
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR5
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR6 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR7 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR12 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR13 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_TMR14 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_WWDT
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_SPI3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_USART3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART5 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref DDL_APB1_GRP1_PERIPH_I2C3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN2 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_CAN3 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_PMU
  *         @arg @ref DDL_APB1_GRP1_PERIPH_DAC1 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART7 (*)
  *         @arg @ref DDL_APB1_GRP1_PERIPH_UART8 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_APB1_GRP1_DisableClockLowPower(uint32_t Periphs)
{
  CLEAR_BIT(RCM->LPAPB1CLKEN, Periphs);
}

#endif /* RCM_LPAPB1_SUPPORT */

/**
  * @}
  */

/** @defgroup BUS_DDL_EF_APB2 APB2
  * @{
  */

/**
  * @brief  Enable APB2 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR8 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART6 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC2 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC3 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SDIO (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI4 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref DDL_APB2_GRP1_PERIPH_COMP (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR9
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR10 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR11
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI5 (*)
  * 
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_APB2_GRP1_PERIPH_AFIO
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOA
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOB
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOC
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOD
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC2
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR8
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART1
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_APB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCM->APB2CLKEN, Periphs);
  /* Delay after an RCM peripheral clock enabling */
  tmpreg = READ_BIT(RCM->APB2CLKEN, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB2 peripheral clock is enabled or not
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR8 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART6 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC2 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC3 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SDIO (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI4 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref DDL_APB2_GRP1_PERIPH_COMP (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR9
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR10 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR11
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI5 (*)
  * 
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_APB2_GRP1_PERIPH_AFIO
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOA
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOB
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOC
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOD
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC2
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR8
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART1
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
*/
__STATIC_INLINE uint32_t DDL_APB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return (READ_BIT(RCM->APB2CLKEN, Periphs) == Periphs);
}

/**
  * @brief  Disable APB2 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR8 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART6 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC2 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC3 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SDIO (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI4 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref DDL_APB2_GRP1_PERIPH_COMP (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR9
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR10 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR11
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI5 (*)
  * 
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_APB2_GRP1_PERIPH_AFIO
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOA
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOB
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOC
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOD
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC2
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR8
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART1
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_APB2_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCM->APB2CLKEN, Periphs);
}

/**
  * @brief  Force APB2 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ALL
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR8 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART6 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC1 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC2 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SDIO (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI4 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref DDL_APB2_GRP1_PERIPH_COMP (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR9
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR10 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR11
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI5 (*)
  * 
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_APB2_GRP1_PERIPH_AFIO
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOA
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOB
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOC
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOD
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC2
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR8
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART1
  *
  *         (*) value not defined in all devices.
  * @retval None
  * @note   ADC1 and ADC2 are not available on all devices.
*/
__STATIC_INLINE void DDL_APB2_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCM->APB2RST, Periphs);
}

/**
  * @brief  Release APB2 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ALL
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR8 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART6 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC1 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC2 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SDIO (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI4 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref DDL_APB2_GRP1_PERIPH_COMP (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR9
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR10 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR11
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI5 (*)
  * 
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_APB2_GRP1_PERIPH_AFIO
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOA
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOB
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOC
  *         @arg @ref DDL_APB2_GRP1_PERIPH_GPIOD
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC2
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR8
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART1
  *
  *         (*) value not defined in all devices.
  * @retval None
  * @note   ADC1 and ADC2 are not available on all devices.
*/
__STATIC_INLINE void DDL_APB2_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCM->APB2RST, Periphs);
}

#if defined(RCM_LPAPB2_SUPPORT)

/**
  * @brief  Enable APB2 peripheral clocks in low-power mode
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR8 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART6 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC2 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC3 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SDIO (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI4 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref DDL_APB2_GRP1_PERIPH_COMP (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR9
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR10 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR11
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI5 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_APB2_GRP1_EnableClockLowPower(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCM->LPAPB2CLKEN, Periphs);
  /* Delay after an RCM peripheral clock enabling */
  tmpreg = READ_BIT(RCM->LPAPB2CLKEN, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable APB2 peripheral clocks in low-power mode
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR8 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_USART6 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC2 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_ADC3 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SDIO (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI4 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref DDL_APB2_GRP1_PERIPH_COMP (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR9
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR10 (*)
  *         @arg @ref DDL_APB2_GRP1_PERIPH_TMR11
  *         @arg @ref DDL_APB2_GRP1_PERIPH_SPI5 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void DDL_APB2_GRP1_DisableClockLowPower(uint32_t Periphs)
{
  CLEAR_BIT(RCM->LPAPB2CLKEN, Periphs);
}

#endif /* RCM_LPAPB2_SUPPORT */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCM) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DDL_BUS_H */

